rt/ws/security/src/test/java/org/apache/cxf/ws/security/wss4j/signed_missing_signed_header.xml

<soapenv:Envelope xmlns:ser="http://blah" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:Signature Id="Signature-5" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-6">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>a0+IBfK+SfKXlyyJcIzg+M6OouI=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
VGURrUkUzHrVxveLRhp7ttaGSY6Aj+LR3k75pLLsFgXDEqSHOO2IsUnAt6cLGAGE/ijKKsip6g+O
K1AuHQleQLbc/sGyIkRDLLU+slV2s5XTC0x1DeBGFKy3O8D48obEQFnSfb2MpF/mtOarMLGc0BZ0
J5bPqmDSmsqTvzcC/MY=
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-B5419464DCB3C8B05A12646118281118">
<wsse:SecurityTokenReference wsu:Id="STRId-B5419464DCB3C8B05A12646118281279" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ds:X509Data>
<ds:X509IssuerSerial>
<ds:X509IssuerName>CN=myAlias</ds:X509IssuerName>
<ds:X509SerialNumber>1181668586</ds:X509SerialNumber>
</ds:X509IssuerSerial>
</ds:X509Data></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature></wsse:Security>
      <Header wsu:Id="id-6" xmlns="http://www.sdj.pl" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">1234</Header>
      <Header xmlns="http://www.sdj.pl">5678</Header>
   </soapenv:Header>
   <soapenv:Body>
     <echo xmlns="http://www.sdj.pl">
       <in0>A</in0>    
     </echo>
   </soapenv:Body>
</soapenv:Envelope>
